[{"title":"磨刀不误砍柴工-Eclipse插件推荐以及安装","date":"2017-03-10T07:00:00.000Z","path":"2017/03/10/磨刀不误砍柴工-Eclipse插件推荐以及安装/","text":"“ 工预善其事,必要先利其器”。程序员很多时候都是要运用开发工具进行开发的，大多数都有自己的一套开发工具，我们称之为集成开发环境（IDE，Integrated Development Environment ）。而java开发的IDE首当其冲的就是eclipse。也有很多myeclipse，但由于myeclipse并非免费，而且也就是eclipse加上一些插件集成的IDE。我们可以自己利用插件灵活地搭建一套自己的集成开发环境。 1、插件推荐：egit-2.3.1：eclipse整合git分布式版本控制软件的插件，便于团队进行协助开发。 svn：eclipse整合svn版本控制软件的插件，同样也是便于团队协助开发。 Junit：eclipse的单元测试框架，便于进行单元测试。 fatjar：可以将项目进行打包的插件，非常方便 FindBugs：FindBugs 是一个静态分析工具，它检查类或者 JAR 文件，将字节码与一组缺陷模式进行对比以发现可能的问题。有了静态分析工具，就可以在不实际运行程序的情况对软件进行分析。 checkstyle：主要是检查代码是否规范的插件，会给出相关建议，不是太给力，需要自己酌情处理。 org.sf.feeling.decompiler_1.0.2：反编译插件，这个插件我强烈推荐，有很多情况下项目某些部分不提供源码，通过他可以很方便。","tags":[{"name":"java","slug":"java","permalink":"https://github.com/Caesarxp/tags/java/"},{"name":"Eclipse","slug":"Eclipse","permalink":"https://github.com/Caesarxp/tags/Eclipse/"}]},{"title":"写给五年后自己的一封信","date":"2017-03-09T12:43:23.000Z","path":"2017/03/09/写给五年后自己的一封信/","text":"五年后的自己： 你好！ 我是2016年的你，如果科技允许的话，真的很希望可以和你对对话。但我仍然希望和五年后的你聊聊。用这种原始的方式，让时间作为我们的信使与你进行时空的连接。 让我猜猜你五年后会怎样。 五年后，你将在一座城市扎根了，有一份奋斗一生的事业。一个春日的早晨，城市早已经苏醒，脚步如往日一样轻快，你依然随着人潮上班，不同的是与刚来城市时迷茫，现今的你事业有了些许的成就，你度过了艰难的职业的瓶颈期，走过了迷茫的尝试期，来到公司，又开始了繁忙的一天。即使事业依然忙碌，但你却乐在其中。我相信你，会有一片自己的事业。 五年后，你可以酷酷地说着一口流利的英文。可以安安静静在午后的窗边，透着午后些许的阳光，品着一杯香茗，手中拿着一本英文书。学生时代的你，为英语吃尽了苦头。今天的我看到身边的人可以说一口流利的英语感到羡慕，而五年将是你踏入社会极为关键的五年，我相信你，已经征服了这座大山。 五年后，你会写一本书。又是一个雨季，屋外滴滴答答下起了雨，雨敲打着窗发出啪嗒的声音，听着屋外的雨声，你伸了伸懒腰，端起一杯拿铁，奶香与咖啡的结合冲淡了你的疲惫，接着继续盯着荧光屏，敲打着键盘，键盘上的字母被每日的敲击变得模糊不清，但你的作品却越来越好，露出了欣慰的笑容。大学时代的你，也曾尝试写作，当时只为自己心中的一些热爱，书写属于自己的故事。虽然当时得到了不少人的认同，但遗憾地是未能坚持。希望现在的我开始写作，能够坚持到未来。我相信你，这份热爱不变。 五年后，你可以将心中的画面，用另一种形式记录下来。或许你会在一个清晨，用一支画笔，给你昨晚写的故事绘下一张插图；或许你会在疲乏过后，听着优雅的乐曲，用一支画笔在纸上不断划过，绘下心中最美的图，卸下一整日的疲惫。曾经的你，不知因为什么，喜欢上了用画笔去释放心中的苦闷与抑郁。曾经的你用铅字笔在一张张废纸上不断地划过，看似无心无意，其实你的心中希望得到周边的称赞，最终你得到的是一片唏嘘。你拿着那一张张废纸，你却视它如宝。你开始慢慢地学习绘画的一些东西，你发现其实很难，你慢慢地觉得这是一个减压的好法子。可你未曾想到，你的废纸上已经跃出美丽的画面。我相信你，这份不屈不变。 五年后，你会拥有一间属于自己，也属于母亲的房。不论是大城还是小城，江南的傍晚尤为的美丽，树影婆娑，晚风拂过湖面，掠过你和母亲的身边，你们走在斜阳透过梧桐形成宝石般光斑的大道上，你挽着母亲说着每日的琐事，慢慢走回属于自己的陋室。幼时的你住在一座未完工的平房中，房顶长年漏雨，加之南方常年潮湿的天气，房壁常常长出厚厚的青苔，冬冷夏热。夏日里，呼呼的风扇吹打在脸上是一阵阵热浪，冬日里，床板上时常渗出水珠。当时的你说，我一定要带母亲逃离这里。今天的母亲已经没有住在那里，但仍是租住的房屋，我希望母亲有一天可以住进属于自己的新房。我相信你，会拥有一片属于自己的天地。 五年后，你会有女友陪伴。海边的夜晚，海浪拍打在沙滩上，配合着海风与空气摩擦的啸声，形成了夜间最美的交响乐，女友挽着漫步在海边，只见不远处升起无数的孔明灯，仿若漫天繁星，你突然单膝跪地，掏出早已买好的戒指，带着略显局促的声音高声问道:“我愿意为你营造一片星空，你是否愿意一世相挽至夕阳。”我不知道你的女友会是什么样子，但我希望那时的你不要自卑。还记得吗？高中时的你，为每个同学写同学录留言，你为每个同学都写了首藏头诗作为祝福，你唯独落下了她，一个你暗恋了整个高中的女孩，一直未能表达自己的爱意。她气冲冲地跑过来质问你，为什么其他人都有一首藏头诗，而她却没有。你愣了好一会，最后挠着头憨笑着:“我想不出来怎么写。”你怕自己写的一首藏头诗都会泄露你心中的爱意，怕你与她最后连朋友都做不了，从此你不再写诗。曾经你以为你的自卑源于贫穷。现在的我觉得是源于我那颗不愿受伤的心，或者我只是个懦夫。我相信五年后的你，不再懦弱，不再自卑。 五年后，你会踏上去拉萨的道路。山峦叠嶂，白云苍狗，湛蓝的天空下，两三点行人，结拜同行，怀揣着对高原的向往，走在川藏大道上，惊叹于路边造物者鬼斧神工的设计，路途的疲乏和缺氧的晕眩也敌不过你对这个世界的好奇。我相信五年后的你，会站在拉萨的布达拉宫里。 五年其实很长，也很短。弹指一挥间，可能就晃晃度过五年，我只愿时间走得慢一点，这样你就能多做些事。 时间是个奇怪的信使，他告诉我，你的回信，他无法帮我带来。我对时间说，信寄出去的那一刻，我已经收到你的回信。我将以每一天的行动答复你的回信。 此致 敬礼！ 祝五年后的你，一切安好！愿五年后的一切都是那么美好！ 二零一六年的自己 2016年9月6日","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/Caesarxp/tags/随笔/"}]}]